Revit 2026 API

# MassSurfaceDataIsUnderground Property

---

Indicates if the roof, floor, slab, or wall surface reference is underground.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsUnderground { get; set; }
```
```vb
Public Property IsUnderground As Boolean
	Get
	Set
```
```cpp
public:
property bool IsUnderground {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsUnderground : bool with get, set
```

#### Property Value

Boolean

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace